system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 1; 0.095492 0.046049; 0.763820 0.030152;

vertices
(
    // Back Plane

    // Domain Vertices
    (-10 -10 0)         //0
    (0.763820 -10 0)    //1
    (1 -10 0)           //2
    (15 -10 0)          //3
    (15 0 0)            //4
    (15 10 0)           //5
    (1 10 0)            //6
    (0.763820 10 0)     //7
    (-10 10 0)          //8

    // Airfoil Vertices
    (0.095492 -0.046049 0)  //9
    (0.763820 -0.030152 0)  //10
    (1 0 0)                 //11
    (0.763820 0.030152 0)   //12
    (0.095492 0.046049 0)   //13


    // Front Plane
    
// Domain Vertices
    (-10 -10 0.001)         //14
    (0.763820 -10 0.001)    //15
    (1 -10 0.001)           //16
    (15 -10 0.001)          //17
    (15 0 0.001)            //18
    (15 10 0.001)           //19
    (1 10 0.001)            //20
    (0.763820 10 0.001)     //21
    (-10 10 0.001)          //22

    // Airfoil Vertices
    (0.095492 -0.046049 0.001)  //23
    (0.763820 -0.030152 0.001)  //24
    (1 0 0.001)                 //25
    (0.763820 0.030152 0.001)   //26
    (0.095492 0.046049 0.001)   //27
   
);

edges
(
    // Back Plane
    
    // Airfoil Splines
    spline 11 12
    (
        (0.999416	0.001342	0)
        (0.997666	0.001587	0)
        (0.994753	0.001994	0)
        (0.990685	0.00256		0)
        (0.985471	0.00328		0)
        (0.979123	0.004152	0)
        (0.971656	0.005169	0)
        (0.963087	0.006324	0)
        (0.953437	0.007611	0)
        (0.942728	0.009022	0)
        (0.930985	0.010549	0)
        (0.918235	0.012182	0)
        (0.904509	0.013914	0)
        (0.889837	0.015735	0)
        (0.874255	0.017635	0)
        (0.8578		0.019605	0)
        (0.840508	0.021635	0)
        (0.822421	0.023714	0)
        (0.803581	0.025834	0)
        (0.784032	0.027983	0)
    )
    
    spline 12 13
    (
        (0.742992	0.032329	0)
        (0.721596	0.034506	0)
        (0.699682	0.03667		0)
        (0.677303	0.038811	0)
        (0.654509	0.040917	0)
        (0.631354	0.042978	0)
        (0.607892	0.04498		0)
        (0.584179	0.046912	0)
        (0.560268	0.048762	0)
        (0.536217	0.050516	0)
        (0.512082	0.052162	0)
        (0.487918	0.053687	0)
        (0.463783	0.055077	0)
        (0.439732	0.05632		0)
        (0.415822	0.057403	0)
        (0.392108	0.058314	0)
        (0.368646	0.059042	0)
        (0.345492	0.059575	0)
        (0.322698	0.059903	0)
        (0.300318	0.060017	0)
        (0.278404	0.05991		0)
        (0.257008	0.059576	0)
        (0.23618    0.059008	0)
        (0.215968	0.058205	0)
        (0.196419	0.057164	0)
        (0.177579	0.055886	0)
        (0.159492	0.054372	0)
        (0.142201	0.052625	0)
        (0.125745	0.050651	0)
        (0.110163	0.048457	0)
    )

    spline 13 9
    (
        (0.081765	0.043437	0)
        (0.069015	0.040631	0)
        (0.057272	0.037641	0)
        (0.046563	0.034479	0)
        (0.036913	0.031156	0)
        (0.028344	0.027683	0)
        (0.020877	0.024071	0)
        (0.014529	0.02033		0)
        (0.009315	0.016471	0)
        (0.005247	0.012501	0)
        (0.002334	0.008429	0)
        (0.000584	0.00426		0)
        (0 0 0)
        (0.000584	-0.00426	0)
        (0.002334	-0.008429	0)
        (0.005247	-0.012501	0)
        (0.009315	-0.016471	0)
        (0.014529	-0.02033	0)
        (0.020877	-0.024071	0)
        (0.028344	-0.027683	0)
        (0.036913	-0.031156	0)
        (0.046563	-0.034479	0)
        (0.057272	-0.037641	0)
        (0.069015	-0.040631	0)
        (0.081765	-0.043437	0)
    )

    spline 9 10
    (
        (0.110163	-0.048457	0)
        (0.125745	-0.050651	0)
        (0.142201	-0.052625	0)
        (0.159492	-0.054372	0)
        (0.177579	-0.055886	0)
        (0.196419	-0.057164	0)
        (0.215968	-0.058205	0)
        (0.23618	-0.059008	0)
        (0.257008	-0.059576	0)
        (0.278404	-0.05991	0)
        (0.300318	-0.060017	0)
        (0.322698	-0.059903	0)
        (0.345492	-0.059575	0)
        (0.368646	-0.059042	0)
        (0.392108	-0.058314	0)
        (0.415822	-0.057403	0)
        (0.439732	-0.05632	0)
        (0.463783	-0.055077	0)
        (0.487918	-0.053687	0)
        (0.512082	-0.052162	0)
        (0.536217	-0.050516	0)
        (0.560268	-0.048762	0)
        (0.584179	-0.046912	0)
        (0.607892	-0.04498	0)
        (0.631354	-0.042978	0)
        (0.654509	-0.040917	0)
        (0.677303	-0.038811	0)
        (0.699682	-0.03667	0)
        (0.721596	-0.034506	0)
        (0.742992	-0.032329	0)
    )

    spline 10 11
    (
        (0.784032	-0.027983	0)
        (0.803581	-0.025834	0)
        (0.822421	-0.023714	0)
        (0.840508	-0.021635	0)
        (0.8578		-0.019605	0)
        (0.874255	-0.017635	0)
        (0.889837	-0.015735	0)
        (0.904509	-0.013914	0)
        (0.918235	-0.012182	0)
        (0.930985	-0.010549	0)
        (0.942728	-0.009022	0)
        (0.953437	-0.007611	0)
        (0.963087	-0.006324	0)
        (0.971656	-0.005169	0)
        (0.979123	-0.004152	0)
        (0.985471	-0.00328	0)
        (0.990685	-0.00256	0)
        (0.994753	-0.001994	0)
        (0.997666	-0.001587	0)
        (0.999416	-0.001342	0)
    )

    arc 8 0 (-15 0 0)


    // Front Plane

    // Airfoil Splines
    spline 25 26
    (
        (0.999416	0.001342	0.001)
        (0.997666	0.001587	0.001)
        (0.994753	0.001994	0.001)
        (0.990685	0.00256		0.001)
        (0.985471	0.00328		0.001)
        (0.979123	0.004152	0.001)
        (0.971656	0.005169	0.001)
        (0.963087	0.006324	0.001)
        (0.953437	0.007611	0.001)
        (0.942728	0.009022	0.001)
        (0.930985	0.010549	0.001)
        (0.918235	0.012182	0.001)
        (0.904509	0.013914	0.001)
        (0.889837	0.015735	0.001)
        (0.874255	0.017635	0.001)
        (0.8578		0.019605	0.001)
        (0.840508	0.021635	0.001)
        (0.822421	0.023714	0.001)
        (0.803581	0.025834	0.001)
        (0.784032	0.027983	0.001)
    )
    
    spline 26 27
    (
        (0.742992	0.032329	0.001)
        (0.721596	0.034506	0.001)
        (0.699682	0.03667		0.001)
        (0.677303	0.038811	0.001)
        (0.654509	0.040917	0.001)
        (0.631354	0.042978	0.001)
        (0.607892	0.04498		0.001)
        (0.584179	0.046912	0.001)
        (0.560268	0.048762	0.001)
        (0.536217	0.050516	0.001)
        (0.512082	0.052162	0.001)
        (0.487918	0.053687	0.001)
        (0.463783	0.055077	0.001)
        (0.439732	0.05632		0.001)
        (0.415822	0.057403	0.001)
        (0.392108	0.058314	0.001)
        (0.368646	0.059042	0.001)
        (0.345492	0.059575	0.001)
        (0.322698	0.059903	0.001)
        (0.300318	0.060017	0.001)
        (0.278404	0.05991		0.001)
        (0.257008	0.059576	0.001)
        (0.23618    0.059008	0.001)
        (0.215968	0.058205	0.001)
        (0.196419	0.057164	0.001)
        (0.177579	0.055886	0.001)
        (0.159492	0.054372	0.001)
        (0.142201	0.052625	0.001)
        (0.125745	0.050651	0.001)
        (0.110163	0.048457	0.001)
    )

    spline 27 23
    (
        (0.081765	0.043437	0.001)
        (0.069015	0.040631	0.001)
        (0.057272	0.037641	0.001)
        (0.046563	0.034479	0.001)
        (0.036913	0.031156	0.001)
        (0.028344	0.027683	0.001)
        (0.020877	0.024071	0.001)
        (0.014529	0.02033		0.001)
        (0.009315	0.016471	0.001)
        (0.005247	0.012501	0.001)
        (0.002334	0.008429	0.001)
        (0.000584	0.00426		0.001)
        (0 0 0.001)
        (0.000584	-0.00426	0.001)
        (0.002334	-0.008429	0.001)
        (0.005247	-0.012501	0.001)
        (0.009315	-0.016471	0.001)
        (0.014529	-0.02033	0.001)
        (0.020877	-0.024071	0.001)
        (0.028344	-0.027683	0.001)
        (0.036913	-0.031156	0.001)
        (0.046563	-0.034479	0.001)
        (0.057272	-0.037641	0.001)
        (0.069015	-0.040631	0.001)
        (0.081765	-0.043437	0.001)
    )

    spline 23 24
    (
        (0.110163	-0.048457	0.001)
        (0.125745	-0.050651	0.001)
        (0.142201	-0.052625	0.001)
        (0.159492	-0.054372	0.001)
        (0.177579	-0.055886	0.001)
        (0.196419	-0.057164	0.001)
        (0.215968	-0.058205	0.001)
        (0.23618	-0.059008	0.001)
        (0.257008	-0.059576	0.001)
        (0.278404	-0.05991	0.001)
        (0.300318	-0.060017	0.001)
        (0.322698	-0.059903	0.001)
        (0.345492	-0.059575	0.001)
        (0.368646	-0.059042	0.001)
        (0.392108	-0.058314	0.001)
        (0.415822	-0.057403	0.001)
        (0.439732	-0.05632	0.001)
        (0.463783	-0.055077	0.001)
        (0.487918	-0.053687	0.001)
        (0.512082	-0.052162	0.001)
        (0.536217	-0.050516	0.001)
        (0.560268	-0.048762	0.001)
        (0.584179	-0.046912	0.001)
        (0.607892	-0.04498	0.001)
        (0.631354	-0.042978	0.001)
        (0.654509	-0.040917	0.001)
        (0.677303	-0.038811	0.001)
        (0.699682	-0.03667	0.001)
        (0.721596	-0.034506	0.001)
        (0.742992	-0.032329	0.001)
    )

    spline 24 25
    (
        (0.784032	-0.027983	0.001)
        (0.803581	-0.025834	0.001)
        (0.822421	-0.023714	0.001)
        (0.840508	-0.021635	0.001)
        (0.8578		-0.019605	0.001)
        (0.874255	-0.017635	0.001)
        (0.889837	-0.015735	0.001)
        (0.904509	-0.013914	0.001)
        (0.918235	-0.012182	0.001)
        (0.930985	-0.010549	0.001)
        (0.942728	-0.009022	0.001)
        (0.953437	-0.007611	0.001)
        (0.963087	-0.006324	0.001)
        (0.971656	-0.005169	0.001)
        (0.979123	-0.004152	0.001)
        (0.985471	-0.00328	0.001)
        (0.990685	-0.00256	0.001)
        (0.994753	-0.001994	0.001)
        (0.997666	-0.001587	0.001)
        (0.999416	-0.001342	0.001)
    )

    arc 22 14 (-15 0 0.001)
);

blocks
(
    hex (0 9 13 8 14 23 27 22)(150 300 1) simpleGrading (0.001 1 1)   //(100 60 1) SG(0.0005 1 1)

    hex (0 1 10 9 14 15 24 23)(750 150 1) simpleGrading (1 0.001 1)  //(160 100 1) SG(1 0.0005 1)
    hex (1 2 11 10 15 16 25 24)(300 150 1) simpleGrading (1 0.001 1)  //(72 100 1) SG(1 0.0005 1)
    hex (2 3 4 11 16 17 18 25)(300 150 1) simpleGrading (250 0.001 1) //(200 100 1) SG(100 0.0005 1)

    hex (13 12  7 8 27 26 21 22)(750 150 1) simpleGrading (1 1000 1)  //(160 100 1) SG(1 2000 1)
    hex (12 11 6 7 26 25 20 21)(300 150 1) simpleGrading (1 1000 1)    //(72 100 1) SG(1 2000 1)
    hex (11 4 5 6 25 18 19 20)(300 150 1) simpleGrading (250 1000 1)   //(200 100 1) SG(100 2000 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 14 22 8)
            (0 14 15 1)
            (1 15 16 2)
            (2 16 17 3)
            (8 22 21 7)
            (7 21 20 6)
            (6 20 19 5)
        );
    }
    outlet
    {
        type patch;
        faces
        (
           (3 17 18 4)
           (4 18 19 5)
        );
    }
    front
    {
        type empty;
        faces
        (
           (14 23 27 22)
           (14 15 24 23)
           (15 16 25 24)
           (16 17 18 25)
           (25 18 19 20)
           (26 25 20 21)
           (27 26 21 22)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 9 13 8)
            (0 1 10 9)
            (1 2 11 10)
            (2 3 4 11)
            (11 4 5 6)
            (12 11 6 7)
            (13 12 7 8)
        );
    }
    airfoil
    {
        type wall;
        faces
        (
            (12 26 27 13)
            (13 27 23 9)
            (9 23 24 10)
        );
    }
    trailingEdge
    {
        type wall;
        faces
        (
            (10 24 25 11)
            (11 25 26 12)
        );
    }    
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
