0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (33.00946061 8.230182888 0);

boundaryField
{
    inlet
	{
		type            fixedValue;
		value           $internalField;
	}

    outlet
    {
        type            zeroGradient;
        //inletValue      uniform (0 0 0);
        //value           $internalField;
    }

    airfoil
    {
        type            noSlip;
    }
    
    trailingEdge
    {
        type            noSlip;
	}

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}


// ************************************************************************* //
