0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    inlet
	{
		type            fixedValue;
        //intensity       0.06;
        //value           uniform 0.01;
		value           $internalField;
	}

    outlet
    {
        type            zeroGradient;
        //inletValue      $internalField;
        //value           $internalField;
    }

    airfoil
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    
    trailingEdge
    {
        type            kqRWallFunction;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }


}


// ************************************************************************* //
