0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1e3;

boundaryField
{
    inlet
	{
		type            fixedValue;
        //mixingLength    0.07;
        //phi             phi;
        //k               k;
        //value           uniform 0.00003;
		value           $internalField;
	}

    outlet
    {
        type            zeroGradient;
    }

    airfoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    trailingEdge
    {
        type            omegaWallFunction;
        //blending        binomial;
        //n               2;
        value           $internalField;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }	   
}    


// ************************************************************************* //
