0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    trailingEdge
    {
        
        type                 groovyBC;
        value                uniform (0 0 0);
        valueExpression      "toPoint(vector(0, -0.05*pow(pos().x-0.75,3)/pow(1-0.75,3), 0))"; //-0.05*pow(pos().x-0.75,3)/pow(1-0.75,3)
    }
    
    airfoil
    {
        type 			fixedValue;
        value           uniform (0 0 0);  // No motion
    }
    

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }

    ".*"
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
