system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default     cellLimited Gauss linear 1;

    grad(U)     Gauss linear; 
    grad(p)     Gauss linear;
    grad(k)     Gauss linear; 
    grad(omega) Gauss linear; 
    grad(nut)   Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss linearUpwindV default ;
    div(phi,k)      Gauss linearUpwind default ;
    div(phi,omega)  Gauss linearUpwind default ;
    //div(phi,nuTilda) bounded Gauss linearUpwind grad(nuTilda);

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected ;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected ;
}

wallDist
{
    method          meshWave;
}


// ************************************************************************* //
